TexasInstruments/mcupsdk-core/examples/drivers/epwm/epwm_protection_pru/am263px-cc/r5fss0-0_nortos/example.syscfg
gpio6.$name                = "GPIO_SPEED_LEVEL_IN";
gpio6.GPIO.$assign         = "GPIO";
gpio6.GPIO.gpioPin.$assign = "EPWM5_B";

gpio7.pinDir               = "OUTPUT";
gpio7.$name                = "GPIO_OCP_OUT";
gpio7.GPIO.$assign         = "GPIO";
gpio7.GPIO.gpioPin.$assign = "EPWM6_B";

gpio8.pinDir               = "OUTPUT";
gpio8.$name                = "GPIO_SPEED_LEVEL_OUT";
gpio8.GPIO.$assign         = "GPIO";
gpio8.GPIO.gpioPin.$assign = "EPWM7_B";

mcspi1.$name                 = "CONFIG_MCSPI0";
pmic1.peripheralDriver       = mcspi1;
mcspi1.SPI.$assign           = "SPI1";
mcspi1.mcspiChannel[0].$name = "CONFIG_MCSPI_CH0";

const edma                  = scripting.addModule("/drivers/edma/edma", {}, false);
const edma1                 = edma.addInstance({}, false);
edma1.$name                 = "CONFIG_EDMA0";
mcspi1.edmaDriver           = edma1;
edma1.edmaRmDmaCh[0].$name  = "CONFIG_EDMA_RM0";
edma1.edmaRmQdmaCh[0].$name = "CONFIG_EDMA_RM1";
edma1.edmaRmTcc[0].$name    = "CONFIG_EDMA_RM2";
edma1.edmaRmParam[0].$name  = "CONFIG_EDMA_RM3";

debug_log.enableUartLog            = true;
debug_log.uartLog.$name            = "CONFIG_UART0";
debug_log.uartLog.UART.RXD.$assign = "UART0_RXD";
debug_log.uartLog.UART.TXD.$assign = "UART0_TXD";

mpu_armv71.$name             = "CONFIG_MPU_REGION0";
mpu_armv71.size              = 31;
mpu_armv71.attributes        = "Device";
mpu_armv71.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv71.allowExecute      = false;

mpu_armv72.$name             = "CONFIG_MPU_REGION1";
mpu_armv72.size              = 15;
mpu_armv72.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv73.$name             = "CONFIG_MPU_REGION2";
mpu_armv73.baseAddr          = 0x80000;
mpu_armv73.size              = 15;
mpu_armv73.accessPermissions = "Supervisor RD+WR, User RD";

mpu_armv74.$name             = "CONFIG_MPU_REGION3";
mpu_armv74.accessPermissions = "Supervisor RD+WR, User RD";
mpu_armv74.baseAddr          = 0x70000000;
mpu_armv74.size              = 21;

epwm_xbar1.$name                 = "CONFIG_EPWM_XBAR0_INPUTXBAR_TO_ICSSGPI";
epwm_xbar1.xbarOutput            = ["GPIO51"];
epwm_xbar1["xbarConfig-0"].$name = "CONFIG_INPUT_XBAR0";

epwm_xbar2.instance                 = "EPWM_XBAR_1";
epwm_xbar2.$name                    = "CONFIG_EPWM_XBAR1_INPUTXBAR_TO_ICSSGPI";
epwm_xbar2.xbarOutput               = ["GPIO52"];
epwm_xbar2["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR1";
epwm_xbar2["xbarConfig-0"].instance = "INPUT_XBAR_1";

epwm_xbar3.instance                 = "EPWM_XBAR_2";
epwm_xbar3.$name                    = "CONFIG_EPWM_XBAR2_INPUTXBAR_TO_ICSSGPI";
epwm_xbar3.xbarOutput               = ["GPIO53"];
epwm_xbar3["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR2";
epwm_xbar3["xbarConfig-0"].instance = "INPUT_XBAR_2";

epwm_xbar4.instance                 = "EPWM_XBAR_3";
epwm_xbar4.$name                    = "CONFIG_EPWM_XBAR3_INPUTXBAR_TO_ICSSGPI";
epwm_xbar4.xbarOutput               = ["GPIO54"];
epwm_xbar4["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR3";
epwm_xbar4["xbarConfig-0"].instance = "INPUT_XBAR_3";

epwm_xbar5.xbarOutput               = ["ICSSGPO0_PORT0"];
epwm_xbar5.instance                 = "EPWM_XBAR_4";
epwm_xbar5.$name                    = "CONFIG_EPWM_XBAR4_INPUTXBAR_TO_EPWM";
epwm_xbar5["xbarConfig-0"].instance = "INPUT_XBAR_4";
epwm_xbar5["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR4_ICSSGPO_TO_PWMXBAR";

epwm_xbar6.xbarOutput               = ["ICSSGPO1_PORT0"];
epwm_xbar6.instance                 = "EPWM_XBAR_5";
epwm_xbar6.$name                    = "CONFIG_EPWM_XBAR5_INPUTXBAR_TO_EPWM";
epwm_xbar6["xbarConfig-0"].instance = "INPUT_XBAR_5";
epwm_xbar6["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR5_ICSSGPO_TO_PWMXBAR";

epwm_xbar7.xbarOutput               = ["ICSSGPO2_PORT0"];
epwm_xbar7.instance                 = "EPWM_XBAR_6";
epwm_xbar7.$name                    = "CONFIG_EPWM_XBAR6_INPUTXBAR_TO_EPWM";
epwm_xbar7["xbarConfig-0"].instance = "INPUT_XBAR_6";
epwm_xbar7["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR6_ICSSGPO_TO_PWMXBAR";

epwm_xbar8.xbarOutput               = ["ICSSGPO3_PORT0"];
epwm_xbar8.instance                 = "EPWM_XBAR_7";
epwm_xbar8.$name                    = "CONFIG_EPWM_XBAR7_INPUTXBAR_TO_EPWM";
epwm_xbar8["xbarConfig-0"].instance = "INPUT_XBAR_7";
epwm_xbar8["xbarConfig-0"].$name    = "CONFIG_INPUT_XBAR7_ICSSGPO_TO_PWMXBAR";

int_xbar1.$name      = "CONFIG_INT_XBAR0";
int_xbar1.xbarOutput = ["EPWM9_INT"];

/**
 * Pinmux solution for unlocked pins/peripherals. This ensures that minor changes to the automatic solver in a future
 * version of the tool will not impact the pinmux you originally saw.  These lines can be completely deleted in order to
 * re-solve from scratch.
 */
epwm1.EPWM.A.$suggestSolution               = "EPWM0_A";
epwm1.EPWM.B.$suggestSolution               = "EPWM0_B";
epwm2.EPWM.A.$suggestSolution               = "EPWM1_A";
epwm2.EPWM.B.$suggestSolution               = "EPWM1_B";
epwm3.EPWM.A.$suggestSolution               = "EPWM2_A";
epwm3.EPWM.B.$suggestSolution               = "EPWM2_B";
gpio1.GPIO.$suggestSolution                 = "GPIO";
mcspi1.SPI.CLK.$suggestSolution             = "SPI1_CLK";
mcspi1.SPI.D0.$suggestSolution              = "SPI1_D0";
mcspi1.SPI.D1.$suggestSolution              = "SPI1_D1";
mcspi1.mcspiChannel[0].CSn.$suggestSolution = "SPI1_CS0";
debug_log.uartLog.UART.$suggestSolution     = "UART0";
